c5/src/Documents/PickupOrder/PickupOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>PickupOrder</name>
  <posting>Deny</posting>
  <attributes>
    <name>Action</name>
    <type>
      <types>EnumRef.Actions</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Required</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Picked</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityBack</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkgBack</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkgPlan</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPlan</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Shipments</name>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityBack</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkgBack</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkgPlan</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPlan</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Shipment</name>
      <type>
        <types>DocumentRef.Shipment</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/InformationRegisters/PickedShipments/PickedShipments.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>PickedShipments</name>
  <resources>
    <name>PickupOrder</name>
    <type>
      <types>DocumentRef.PickupOrder</types>
    </type>
  </resources>
  <dimensions>
    <name>Shipment</name>
    <type>
      <types>DocumentRef.Shipment</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/InformationRegisters/ShipmentStatuses/ShipmentStatuses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ShipmentStatuses</name>
  <resources>
    <name>Status</name>
    <type>
      <types>EnumRef.ShipmentPoints</types>
    </type>
  </resources>
  <dimensions>
    <name>Document</name>
    <type>
      <types>DocumentRef.Shipment</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

c5/src/Enums/Actions/Actions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Actions</name>
  <enumValues>
    <name>Approve</name>
  </enumValues>
  <enumValues>
    <name>CommitRejection</name>
  </enumValues>
  <enumValues>
    <name>CompleteApproval</name>
  </enumValues>
  <enumValues>
    <name>CompleteDelivery</name>
  </enumValues>
  <enumValues>
    <name>CompleteEdition</name>
  </enumValues>
  <enumValues>
    <name>CompleteInventory</name>
  </enumValues>
  <enumValues>
    <name>CompleteInvoicing</name>
  </enumValues>
  <enumValues>
    <name>CompletePicking</name>
  </enumValues>
  <enumValues>
    <name>CompleteShipment</name>
  </enumValues>
  <enumValues>
    <name>Post</name>
  </enumValues>
  <enumValues>
    <name>Complete</name>
  </enumValues>
  <enumValues>
    <name>Return</name>
  </enumValues>
  <enumValues>
    <name>Reject</name>
  </enumValues>
  <enumValues>
    <name>SendToApproval</name>
  </enumValues>
  <enumValues>
    <name>StartPicking</name>
  </enumValues>
  <enumValues>
    <name>Resolve</name>
  </enumValues>
  <enumValues>
    <name>Rework</name>
  </enumValues>
</mdclass:Enum>

c5/src/Enums/ShipmentPoints/ShipmentPoints.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ShipmentPoints</name>
  <enumValues>
    <name>All</name>
  </enumValues>
  <enumValues>
    <name>Canceled</name>
  </enumValues>
  <enumValues>
    <name>Finish</name>
  </enumValues>
  <enumValues>
    <name>New</name>
  </enumValues>
  <enumValues>
    <name>Picking</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/PickupOrder/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

var CurrentStatus;
var Command;

Procedure BeforeWrite ( Cancel, WriteMode, PostingMode )
	
	if ( DataExchange.Load ) then
		return;
	endif; 
	defineCommand ();
	if ( DeletionMark ) then
		if ( not canRemove () ) then
			Cancel = true;
		endif; 
		removeRelations ();
		return;
	else
		if ( isRemoved () ) then
			Cancel = true;
			return;
		endif; 
	endif; 
	if ( Command = undefined ) then
		return;
	elsif ( Command = Enums.Actions.StartPicking ) then
		setShipments ( Enums.ShipmentPoints.Picking );
		setStatus ( Enums.ShipmentPoints.Picking );
	elsif ( Command = Enums.Actions.CompletePicking ) then
		if ( completeShipments () ) then
			setStatus ( Enums.ShipmentPoints.Finish );
		else
			Cancel = true;
		endif; 
	endif; 
	
EndProcedure

Procedure defineCommand ()
	
	if ( Action.IsEmpty () ) then
		Command = undefined;
	else
		Command = Action;
		Action = undefined;
	endif; 
	
EndProcedure 

Function canRemove ()
	
	if ( IsInRole ( "Administrator" ) ) then
		return true;
	endif; 
	CurrentStatus = InformationRegisters.PickupOrderStatuses.Get ( new Structure ( "Document", Ref ) ).Status;
	if ( CurrentStatus <> Enums.ShipmentPoints.New ) then
		Output.OrderCannotBeChanged ();
		return false;
	endif; 
	return true;
	
EndFunction 

Procedure removeRelations ()
	
	if ( CurrentStatus = Enums.ShipmentPoints.Finish ) then
		return;
	endif;
	clearPickedShipments ();
	setShipments ( Enums.ShipmentPoints.New );
	setStatus ( Enums.ShipmentPoints.Canceled );
	
EndProcedure 

Procedure clearPickedShipments ()
	
	table = getShipments ();
	for each shipment in table do
		r = InformationRegisters.PickedShipments.CreateRecordManager ();
		r.Shipment = shipment;
		r.Delete ();
	enddo; 
	
EndProcedure 

Function getShipments ()
	
	table = Shipments.Unload ( , "Shipment" ).UnloadColumn ( "Shipment" );
	Collections.Group ( table );
	return table;
	
EndFunction 

Procedure setShipments ( Status )
	
	table = getShipments ();
	for each shipment in table do
		setShipmentStatus ( shipment, Status );
	enddo; 
	
EndProcedure 

Procedure setShipmentStatus ( Document, Status )
	
	r = InformationRegisters.ShipmentStatuses.CreateRecordManager ();
	r.Document = Document;
	r.Status = Status;
	r.Write ();
	
EndProcedure 

Procedure setStatus ( Status )
	
	r = InformationRegisters.PickupOrderStatuses.CreateRecordManager ();
	r.Document = Ref;
	r.Status = Status;
	r.Write ();
	
EndProcedure 

Function isRemoved ()
	
	if ( IsNew () or IsInRole ( "Administrator" ) ) then
		return false;
	endif; 
	removed = DF.Pick ( Ref, "DeletionMark as DeletionMark" );
	if ( removed ) then
		Output.DocumentIsRemoved ();
		return true;
	endif; 
	return false;
	
EndFunction 

Function completeShipments ()
	
	table = getShipments ();
	for each shipment in table do
		obj = shipment.GetObject ();
		moveItems ( obj );
		if ( Documents.Shipment.CreateInvoice ( obj ) ) then
			Documents.Shipment.CreateBackOrder ( obj );
			setShipmentStatus ( shipment, Enums.ShipmentPoints.Finish );
		else
			return false;
		endif;
	enddo; 
	return true;
	
EndFunction

Procedure moveItems ( Shipment )
	
	recalculation = false;
	table = Shipment.Items.Unload ();
	rows = Shipments.FindRows ( new Structure ( "Shipment", Shipment.Ref ) );
	vatUse = Shipment.VATUse;
	for each row in rows do
		shipmentRow = table.Find ( row.RowKey, "RowKey" );
		FillPropertyValues ( shipmentRow, row );
		if ( shipmentRow.QuantityBack > 0 ) then
			Computations.Amount ( shipmentRow );
			Computations.Total ( shipmentRow, vatUse );
			recalculation = true;
		endif; 
	enddo; 
	Shipment.Items.Load ( table );
	if ( recalculation ) then
		InvoiceForm.CalcTotals ( Shipment );
		Shipment.Write ();
	endif; 
	
EndProcedure 

#endif
